a = 2 #присваиваем переменной значение 2
b = 3
print (a + b)
a = 6 #присваиваем новое значение
print (a + b)
b = b + 2
print (b)

a = 2 #присваиваем переменной значение 2
#a - имя переменной
#= - оператор присваивания

a += 3 # увеличиваем значение на 3
a = a + 3 # увеличиваем значение на 3

+= # увелиливаем значение на..
-= # уменьшаем значение на ..
*= # умножить 
/= # веществ деление 
//= # целочисленное деление
%= # взятие остатка
**= # возведение в степень
# Имя переменной может состоять из
# букв (строчных и прописных), цифр, подчеркивания _
# должно начинаться с буквы или _
# не должно являться ключевым словом (true, false и тд)
# регистр ИМЕЕТ значение a & A - разные

# Динамическая типизация
a = 2
a = 'abacaba'
a = foo () # значение функции
type (a) - ?

# Ввод данных
input () - читает стороку с клавиатуры
input ('Введите данные')
s = input () # записать в переменную s пользовательский ввод
a = int(input()) #прочитать строку с клавиатуры и преобразовать в число
# Вывод данных:
print ('some output')

